from openai import OpenAI
import json

client = OpenAI(
    api_key="Your api key should be here",
    base_url="https://api.proxyapi.ru/openai/v1",
)



multiline_query = """Ты профессиональный комментатор шахматной партии. 
Найди интересные ходы и прокомментируй , начиная комметарий за 4 хода до интересного момента. 

К интересным ходам нужно относить вилки, серьезные ошибки, приводящие к большому перевесу, шахи, мат. 
Формат входных данных PGN. Формат выходных данных - JSON. Ключи JSON - "comment", "moves", "ts". 
Ключи должны возвращать массивы данных. По ключу "moves" возвращай массив массивов ходов, в каждом массиве должно быть РОВНО четыре предшествующих хода, состоящих из полуходов. учитывай и ходы белых, и ходы черных. Внутри одного массива ходы должны идти подряд
Делай комментарии максимально креативно и необычно. Допустим, целевая аудитория - гонщики. Отвечай на русском. В каждом комментарии опиши ходы, добавленные в ключ "moves". Начинай писать комментарий с первого хода, принадлежащего массиву по ключу "moves". Пиши подробные комментарии. Комментарий должен быть длиной от 400 до 450 символов. Ходы должны быть пронумерованы в соответствии с исходным pgn файлом.
PGN:
[TimeControl "40/5400+30:1800+30"]
[UTCDate "2024.03.02"]
[UTCTime "14:59:56"]
[Event "55th INTERNATIONAL LADIES' GRANDMASTER TOURNAMENT"]
[Site "idChess.com"]
[Date "2024.03.02"]
[Round "1"]
[White "Vujovic, Vera"]
[Black "Djukic, Sandra"]
[Result "1-0"]
[Board "3"]

1.e4 {[%ts 1709391597199][%clk 01:30:28]} d6 {[%ts 1709391602366][%clk 01:30:24]} 2.d4 {[%ts 1709391611782][%clk 01:30:49]} Nf6 {[%ts 1709391616548][%clk 01:30:50]} 3.Nc3 {[%ts 1709391624498][%clk 01:31:11]} e5 {[%ts 1709391628380][%clk 01:31:16]} 4.dxe5 {[%ts 1709391651772][%clk 01:31:18]} dxe5 {[%ts 1709391657348][%clk 01:31:40]} 5.Qxd8+ {[%ts 1709391668000][%clk 01:31:37]} Kxd8 {[%ts 1709391669545][%clk 01:32:09]} 6.f4 {[%ts 1709391690186][%clk 01:31:46]} Bb4 {[%ts 1709391695648][%clk 01:32:33]} 7.Bd2 {[%ts 1709392027298][%clk 01:26:45]} exf4 {[%ts 1709392638413][%clk 01:22:52]} 8.O-O-O {[%ts 1709393537206][%clk 01:12:16]} Bg4 {[%ts 1709395377219][%clk 00:52:42]} 9.Be2 {[%ts 1709395559320][%clk 01:09:44]} Nbd7 {[%ts 1709396392166][%clk 00:39:19]} 10.Bf3 {[%ts 1709396811408][%clk 01:03:14]} Kc8 {[%ts 1709398107598][%clk 00:18:13]} 11.Nge2 {[%ts 1709398243275][%clk 01:01:29]} Ne5 {[%ts 1709398477009][%clk 00:14:49]} 12.Bxg4+ {[%ts 1709398610650][%clk 00:59:45]} Nexg4 {[%ts 1709398802033][%clk 00:12:08]} 13.Rdf1 {[%ts 1709399056972][%clk 00:56:00]} Re8 {[%ts 1709399138709][%clk 00:11:16]} 14.h3 {[%ts 1709399534495][%clk 00:49:54]} Ne3 {[%ts 1709399968777][%clk 00:04:32]} 15.Rxf4 {[%ts 1709400261036][%clk 00:45:32]} Nxg2 {[%ts 1709400333894][%clk 00:03:49]} 16.Rf2 {[%ts 1709400426244][%clk 00:44:30]} Nh4 {[%ts 1709400467271][%clk 00:03:38]} 17.Bg5 {[%ts 1709401075017][%clk 00:34:52]} Bc5 {[%ts 1709401328463][%clk 00:00:-35]} 18.Rff1 {[%ts 1709401758892][%clk 00:28:12]} Ng6 {[%ts 1709401792818][%clk 00:-1:-8]} 19.Bxf6 {[%ts 1709401853422][%clk 00:27:41]} gxf6 {[%ts 1709401856104][%clk 00:00:18]} 20.Rxf6 {[%ts 1709401869804][%clk 00:27:57]} b5 {[%ts 1709401926005][%clk 00:-1:-37]} 21.Rxf7 {[%ts 1709401995518][%clk 00:27:18]} b4 {[%ts 1709402001431][%clk 00:00:16]} 22.Nd5 {[%ts 1709402017305][%clk 00:27:32]} Bd6 {[%ts 1709402021214][%clk 00:00:42]} 23.Nf6 {[%ts 1709402086534][%clk 00:26:57]} Re5 {[%ts 1709402149071][%clk 00:00:09]} 24.Rxh7 {[%ts 1709402225233][%clk 00:26:10]} Kb7 {[%ts 1709402270443][%clk 00:-2:-5]} 25.Rg1 {[%ts 1709402354938][%clk 00:25:16]} Nf8 {[%ts 1709402381943][%clk 00:-2:-32]} 26.Rf7 {[%ts 1709402444330][%clk 00:24:44]} Ne6 {[%ts 1709402462856][%clk 00:00:09]} 27.Rd1 {[%ts 1709402490731][%clk 00:24:46]} Ka6 {[%ts 1709402539935][%clk 00:-3:-10]} 28.h4 {[%ts 1709402581293][%clk 00:24:34]} Rh8 {[%ts 1709402599487][%clk 00:00:01]} 29.Ng3 {[%ts 1709402642760][%clk 00:24:21]} Ra5 {[%ts 1709402682045][%clk 00:-3:-37]} 30.Nf5 {[%ts 1709402713969][%clk 00:24:19]} Be5 {[%ts 1709402747254][%clk 00:-4:-10]} 31.Nd5 {[%ts 1709402789067][%clk 00:24:07]} Rb8 {[%ts 1709402818183][%clk 00:-4:-40]} 32.Re7 {[%ts 1709402860011][%clk 00:23:56]} Bf4+ {[%ts 1709402892324][%clk 00:-5:-12]} 33.Kb1 {[%ts 1709402903401][%clk 00:24:14]} Rxd5 {[%ts 1709402908051][%clk 00:00:13]} 34.Rxe6+ {[%ts 1709402932721][%clk 00:24:20]}  1-0"""

chat_completion = client.chat.completions.create(
    response_format={ "type": "json_object" },
    model="gpt-4o", messages=[{"role": "user", "content": multiline_query}]
)
json_object = chat_completion.choices[0].message.content  # предполагается, что это JSON-объект
data = json.loads(json_object)
with open('output.json', 'w', encoding='utf-8') as json_file: 
        json.dump(data, json_file, indent=4, ensure_ascii=False)

print(chat_completion.choices[0].message.content)
